{
  "__doc__": "Sacred configuration for the experiment.\nParams:\n    num_epochs (int): Number of training epochs.\n    batch_size (int): Batch size for the training.\n    latent_dim (int): Dimensionality of the DPSOM's latent space.\n    som_dim (list): Dimensionality of the self-organizing map.\n    learning_rate (float): Learning rate for the optimization.\n    alpha (float): Student's t-distribution parameter.\n    gamma (float): Weight for the KL term of the PSOM clustering loss.\n    beta (float): Weight for the SOM loss.\n    theta (float): Weight for the VAE loss.\n    epochs_pretrain (int): Number of VAE pretraining epochs.\n    decay_factor (float): Factor for the learning rate decay.\n    decay_steps (float): Number of steps for the learning rate decay.\n    name (string): Name of the experiment.\n    ex_name (string): Unique name of this particular run.\n    logdir (path): Directory for the experiment logs.\n    modelpath (path): Path for the model checkpoints.\n    data_set (string): Data set for the training.\n    validation (bool): If \"True\" validation set is used for evaluation, otherwise test set is used.\n    dropout (float): Dropout factor for the feed-forward layers of the VAE.\n    prior_var (float): Multiplier of the diagonal variance of the VAE multivariate gaussian prior.\n    prior (float): Weight of the regularization term of the ELBO.\n    convolution (bool): Indicator if the model use convolutional layers (True) or feed-forward layers (False).\n    val_epochs (bool): If \"True\" clustering results are saved every 10 epochs on default output files.\n    more_runs (bool): Indicator whether to run the job once (False) or multiple times (True) outputting mean and\n                      variance.\n",
  "alpha": 10.0,
  "batch_size": 1,
  "beta": 0.25,
  "convolution": false,
  "data_set": "LBP",
  "decay_factor": 0.99,
  "decay_steps": 5000,
  "dropout": 0.4,
  "epochs_pretrain": 15,
  "ex_name": "hyperopt_10_8-8_2024-06-18_34329",
  "exp_output": false,
  "exp_path": "/home/mhueser/data/variational_psom/static_clustering_FMNIST/robustness",
  "gamma": 0.001,
  "latent_dim": 10,
  "learning_rate": 0.0001,
  "learning_rate_pretrain": 0.0001,
  "logdir": "../logs/hyperopt_10_8-8_2024-06-18_34329",
  "modelpath": "../models/hyperopt_10_8-8_2024-06-18_34329/hyperopt_10_8-8_2024-06-18_34329.ckpt",
  "more_runs": false,
  "name": "hyperopt",
  "num_epochs": 300,
  "prior": 0.5,
  "prior_var": 1,
  "random_seed": 2020,
  "save_pretrain": false,
  "seed": 107083715,
  "som_dim": [
    8,
    8
  ],
  "theta": 1,
  "use_saved_pretrain": false,
  "val_epochs": false,
  "validation": false
}